---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
source: html/fd07df68-863e-a6e7-7d38-fc0aa07c18fc.htm
---
# StructuralSectionGeneralC Members

Creates a new instance of general Channel Cold Formed shape.